Revit 2027 API
TextRange.Start Property
 The start index of a range within the FormattedText.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Start { get; set; }
Public Property Start As Integer
	Get
	Set
public:
property int Start {
	int get ();
	void set (int value);
}
member Start : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for start is negative.
See Also
Reference
TextRange Class
Autodesk.Revit.DB Namespace